In [1]:
import pandas as pd
from sqlalchemy import create_engine

## Cities Table

In [2]:
cities_file = "Resources/cities.csv"
cities_df = pd.read_csv(cities_file)

new_cities_df = cities_df[['id', 'name', 'country']].copy()
new_cities_df = new_cities_df.rename(columns={'id':'city_id', 'name':'city_name'})
new_cities_df.head()

   city_id city_name    country
0        5  Aberdeen   Scotland
1        6  Adelaide  Australia
2        7   Algiers    Algeria
3        9    Ankara     Turkey
4       16     Belém     Brazil

## Tracks Table

In [3]:
tracks_file = "Resources/tracks.csv"
tracks_df = pd.read_csv(tracks_file)

new_tracks_df = tracks_df[['city_id','length']].copy()
track_length = new_tracks_df.groupby('city_id').sum()
track_length.reset_index(inplace=True)
track_length.head()

   city_id   length
0        1  1472481
1        4   475631
2       14   630124
3       15   685994
4       19     1231

## Track Length by City

In [4]:
# track_length_df = new_cities_df.merge(track_length, on='city_id')
# track_length_df.sort_values(by='city_name', inplace=True)
# track_length_df.reset_index(inplace=True, drop=True)
# track_length_df.head(10)

   city_id  city_name        country  length
0      275     Angers         France   33944
1       14  Barcelona          Spain  630124
2       15    Beijing          China  685994
3       19     Berlin        Germany    1231
4      283   Besancon         France   28824
5      258     Bilbao          Spain   62962
6       21     Bogotá       Colombia  173514
7       23   Bordeaux         France  129963
8      139     Boston  United States  724935
9      293      Brest         France   28902

## Stations Table

In [5]:
# stations_file = "Resources/stations.csv"
# stations_df = pd.read_csv(stations_file)

# new_stations_df = stations_df[['city_id', 'id','name']].copy()
# # new_stations_df.sort_values('city_id', inplace=True)
# # new_stations_df.reset_index(inplace=True, drop=True)
# # new_stations_df.head()

# station_count = new_stations_df.groupby('city_id')['name'].nunique()
# station_count = pd.DataFrame(station_count)
# station_count = station_count.rename({'name':'station_count'})
# station_count.reset_index(inplace=True)
# station_count.head()

   city_id  name
0        1   572
1        4   304
2        8     2
3       14   106
4       15     0

## Connect to SQL

In [10]:
rds_connection_string = "postgres:3ll3nhsu@localhost:5432/ETL_Project"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [11]:
# Confirm tables
engine.table_names()

['cities', 'tracks']

In [13]:
new_cities_df.to_sql(name='cities', con=engine, if_exists='append', index=False)

In [17]:
track_length.to_sql(name='tracks', con=engine, if_exists='append', index=False)